{
  "characters": [
    {
      "id": "1",
      "name": "Iron Man",
      "description": "Billionaire Tony Stark became a superhero after creating the Iron Man suit. ",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/8654427-ezgif-1-2f113089e4.jpg"
    },
    {
      "id": "2",
      "name": "Captain America",
      "description": "After undergoing a secret experiment at the hands of the United States government, Steve Rodgers went from frail young man to a supersoldier.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/8459983-rco031_1650495781.jpg"
    },
    {
      "id": "3",
      "name": "Hulk",
      "description": "Bruce Banner is one of the most famous members of the Avengers. He's known for his TV catchphrase.You wouldn't like me when I'm angry.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/7892286-immortal_hulk_vol_1_38_.jpg"
    },
    {
      "id": "4",
      "name": "Thor",
      "description": "Thor, the son of Odin and brother of Loki, became a much more popular character at the start of the Marvel Cinematic Universe. ",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/8632242-rco009_1653501316.jpg"
    },
    {
      "id": "5",
      "name": "Black Widow",
      "description": "Natasha Romanov may have started out as a Russian spy but after defecting to the United States she's become one of the few Avengers without superhero powers.",
      "image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/748f1047-63eb-4002-b987-5866e7dbaf88/dd7qmev-cc75c5dc-ea4f-46cc-bdb1-1045e71ca693.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzc0OGYxMDQ3LTYzZWItNDAwMi1iOTg3LTU4NjZlN2RiYWY4OFwvZGQ3cW1ldi1jYzc1YzVkYy1lYTRmLTQ2Y2MtYmRiMS0xMDQ1ZTcxY2E2OTMuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.f98ywp07_Ue-7dWwAyLZKdG8ShlC01H91RynS-DUBN8"
    },
    {
      "id": "6",
      "name": "Black Panther",
      "description": "T'Challa is the leader of the African nation of Wakanda making him one of the richest members of the Marvel Universe. He was also the first African superhero.",
      "image": "https://upload.wikimedia.org/wikipedia/en/9/9f/Black_Panther_OS_Vol_1_2.png"
    },
    {
      "id": "7",
      "name": "Moon Knight",
      "description": "Marc Spector was given his superhuman powers by the Egyptian moon god Khonshu. ",
      "image": "https://www.liveabout.com/thmb/X2t0Amzbssa50OUm2eItjlxU8H0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/moonknight-58bad7e03df78c353c4d2476.jpg"
    },
    {
      "id": "8",
      "name": "Dr Strange",
      "description": "Doctor Stephen Strange is a fictional character appearing in American comic books published by Marvel Comics. Created by Steve Ditko, the character first appeared in Strange Tales #110. Doctor Strange serves as Sorcerer Supreme, the primary protector of Earth against magical and mystical threats.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/8304261-death_of_doctor_strange_vol_1_4.jpg"
    },
    {
      "id": "9",
      "name": "Iceman",
      "description": "Iceman is a mutant born with superhuman abilities. He has the ability to manipulate ice and cold by freezing water vapor around him. This allows him to freeze objects, as well as cover his body with ice.",
      "image": "https://upload.wikimedia.org/wikipedia/en/0/03/Iceman.png"
    },
    {
      "id": "10",
      "name": "Punisher",
      "description": " the Punisher was an Italian-American former US Marine who served in multiple tours of duty, including the Siancong War, where he received the Bronze Star, Silver Star, and four Purple Hearts. He became a vigilante after seeing his wife and children gunned down for accidentally observing a Mafia hit. Now with a distinct death's head skull adorning his chest, he devoted his life to the task of destroying organized crime wherever he found it",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/11125/111253019/6465266-punisher_vol_12_1_textless.jpg"
    },
    {
      "id": "11",
      "name": "Deadpool",
      "description": " Wade Wilson is a former test subject of the Weapon X program, where he received his regenerative healing factor through the scientific experiments conducted upon him. A prominent enemy, ally and later, member of X-Force. He's famous for breaking the Fourth Wall.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/11131/111317321/6386545-deadpool_assassin_vol_1_2_textless.jpg"
    },
    {
      "id": "12",
      "name": "Gambit",
      "description": " A charming master thief and skilled martial artist who became a member of the X-Men, Gambit possesses the mutant ability to change potential energy in inanimate objects into kinetic energy which causes them to explode. His signature move is throwing kinetically-charged playing cards at his opponents.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/11126/111269625/7324346-excalibur%20variant.jpg"
    },
    {
      "id": "13",
      "name": "Cyclops",
      "description": " The first X-Man, Scott Summers possesses the mutant ability to fire powerful concussive blasts through his eyes that act as a portal to another dimension full of the force that makes up his optic blast. He is visually distinctive for the ruby quartz visor he wears to control his devastating power. A born leader, Cyclops succeeded his mentor Professor X to command the X-Men.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/7740086-rco001_1609391996.jpg"
    },
    {
      "id": "14",
      "name": "Nightcrawler",
      "description": " Kurt Wagner is a prominent member of the X-Men and former member and leader of Excalibur. He possessed the Neyaphemian ability of teleportation, as well as incredible agility, wall scaling and a prehensile tail. Nightcrawler is a devout Catholic, contrasting his demonic appearance. He is a highly skilled swordsmen and former circus acrobat.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/8645156-ezgif-1-0f4e60d046.jpg"
    },
    {
      "id": "15",
      "name": "Nick Fury",
      "description": " Nicholas Joseph Fury served in World War II as the leader of the Howling Commandos. He later became an agent, and eventually director, of S.H.I.E.L.D. Fury is one of the greatest strategic minds in the world, a born leader and a master of espionage. He currently serves as a replacement Watcher.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/8/80111/5323224-nick%20furia%2016.png"
    },
    {
      "id": "16",
      "name": "Human Torch",
      "description": " The second most powerful member of the Fantastic Four and the younger brother of Sue Richards. Due to an accident caused by cosmic radiation in space, he can manipulate fire, turn his entire body into it and fly. While Johnny is known for his impetuous and sometimes reckless nature, he is also a loyal friend and fearless hero.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/8338234-b5866c56-93ff-4db0-aeca-9844ff09eac3_rw_1200.jpg"
    },
    {
      "id": "17",
      "name": "Professor",
      "description": " Professor Charles Xavier is the creator of the X-Men and founder of the Xavier School for Gifted Youngsters. His dream of peaceful coexistence between mutants and humanity has long been the driving force for the X-Men. An immensely powerful telepath and scientific genius, Xavier was among the world's greatest masterminds. Killed at the hands of a Phoenix crazed Cyclops, Xavier's memory and dream still remains and motivates his X-Men to keep fighting for a world that fears and hates them.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/10/100647/7261595-hox1pichelli.jpg"
    },
    {
      "id": "18",
      "name": "Storm",
      "description": " An Omega Level Mutant and Wakandan Goddess, Ororo Munroe is gifted with the superhuman ability to manipulate the natural energy patterns of the universe to produce weather phonomena ranging from the lightest of breezes to the most powerful solar winds",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/11144/111442876/8795953-gsh.jpg"
    },
    {
      "id": "19",
      "name": "Namor",
      "description": " amor the Sub-Mariner is the ruler of undersea Atlantis. The offspring of a sea captain and an Atlantean princess, he has been both a hero and a villain to the surface world. Namor is one of Marvel's oldest published characters with his origins in the Golden Age of comics.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/12/124259/7642506-0083aa18cc79f26640e29a8594e2e51e.jpg"
    },
    {
      "id": "20",
      "name": "Ares",
      "description": " Ares is the son of Zeus and the Olympian God of War. After years of fighting against The Avengers, Thor, and mostly his own brother Hercules, Ares joined the ranks of the Avengers. He was a member of Tony Stark's official Avengers team and later Norman Osborn's Dark Avengers. After he attacked Osborn for tricking him in starting Siege on Asgard, he was stopped and killed by the Sentry.",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_small/10/100647/4142212-3339666-fearless%2Bdefenders4au-014%2Bcopy.jpg"
    },
    {
      "id": "21",
      "name": "Kang",
      "description": " Nathaniel Richards has had various incarnations over the years and each identity has its own, ever-expanding history. For the sake of clarity, this article will only cover, essentially, the history of Nathaniel Richards during his time as Kang. ",
      "image": "https://i.pinimg.com/736x/51/40/1f/51401f126ba618c4aef5eb15c938707c.jpg"
    },
    {
      "id": "22",
      "name": "Adam Warlock",
      "description": " Warlock was created by the group of researchers who called themselves the Enclave. The goal of the researchers was to create the perfect human being, the pinnacle of future human evolution. Fortunately for the denizens of Earth, the new being was a creature beyond the control of his creators.",
      "image": "https://i.etsystatic.com/7984009/r/il/967ff0/1860878847/il_fullxfull.1860878847_havi.jpg"
    },
    {
      "id": "23",
      "name": "Victor von Doom",
      "description": "  Doctor Doom is a Latverian politician who serves as the Monarch and Supreme Leader for the Kingdom of Latveria.He was scarred from an accident and wears an iron mask and armor to hide his true face.",
      "image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/8359efd9-fa97-4919-8f02-3712e70a0eeb/df2lx4a-ec6970ea-8a3e-4470-8fd7-3c6478457268.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzgzNTllZmQ5LWZhOTctNDkxOS04ZjAyLTM3MTJlNzBhMGVlYlwvZGYybHg0YS1lYzY5NzBlYS04YTNlLTQ0NzAtOGZkNy0zYzY0Nzg0NTcyNjguanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.5sYcInuITnFZTeNHeFQRwMeWoaS-s77h-Vh5U3e85UM"
    },
    {
      "id": "24",
      "name": "Erik the Red",
      "description": " Erik the Red, who wore the mask of Davan Shakari,[1] was an agent of the Shi'ar Imperial Intelligence and Emperor D'ken's hand on Earth. He operated out of a hidden base inside a lifeless volcano in upstate New York.",
      "image": "https://i.pinimg.com/originals/0e/83/f6/0e83f6236a41e3318a82240f56e332af.jpg"
    },
    {
      "id": "25",
      "name": "Excalibur",
      "description": " Excalibur is a government-sponsored team of extraordinary individuals with special abilities. They fight for the people of the United Kingdom and their interests around the globe. Frequently counting with Captain Britain among their ranks, the team is usually formed by British heroes and former members of the X-Men. ",
      "image": "https://static.tvtropes.org/pmwiki/pub/images/4415846_newavn2013030_cover_99eea1.jpg"
    },
    {
      "id": "26",
      "name": "Falcon",
      "description": "When Steve Rogers asked Air Force Veteran Sam Wilson for help, Wilson immediately agreed. He donned the flight suit he’d used in combat to become the Falcon, setting him on a path towards becoming an Avenger and eventually Captain America.",
      "image": "https://secure.img1-cg.wfcdn.com/im/25609593/compr-r85/1217/121719644/falcon-avengers-animated-standup.jpg"
    },
    {
      "id": "27",
      "name": "War Machine4",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_medium/11/113509/4985511-war%20machine%20anad.jpg",
      "description": "War Machine is a fictional character, a superhero appearing in American comic books published by Marvel Comics."
    },
    {
      "id": "28",
      "name": "Ghost Rider",
      "description": "The title Ghost Rider has been used by individuals indwelled by a Spirit of Vengeance or similar demonic entity such as Zarathos; most famously Johnny Blaze, who sold his soul to the demon-lord Mephisto.",
      "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjLQ6od4aHRl8Ia2MMLltCcvBYnZ81U21f-APCSTomOZy5_2v3mnMOLFpY6R-VlIFT-9XMx8VUC6kFcfKIrs3g7cnkdP6lImY8FYjOIgflDOl5uysbRIkg2pQCoVBFj8kXv50lMEUzJ1Qoq213Z0JlBzjW_8E6kTsZztX4HLkddsODNVikwNw/s680/FjfBBwJWIAw_NR0.jpg"
    },
    {
      "id": "29",
      "name": "Gorilla Man",
      "description": "I am a gorilla and I am a man. I am not a monster. ",
      "image": "https://www.writeups.org/wp-content/uploads/Gorilla-Man-Marvel-Comics-Agents-Atlas-Hale.jpg"
    },
    {
      "id": "30",
      "name": "Hydro-Man",
      "description": "Once an ordinary crewman, Morris Bench was accidentally knocked overboard while stationed on his ship during a battle between Spider-Man and Namor, and fell into the ocean, where a powerful experimental generator was being tested. This led to his transformation into Hydro-Man who, blaming Spider-Man for what happened to him, turned to a life of crime while seeking revenge against the web-slinger.",
      "image": "https://www.writeups.org/wp-content/uploads/Hydro-Man-Marvel-Comics-Spider-Man-Bench.jpg"
    },
    {
      "id": "31",
      "name": "Hellion",
      "description": "Hellion (Julian Keller) is a fictional character, a mutant appearing in American comic books published by Marvel Comics. He was a member of the student body of the Xavier Institute before its closing and is a member of the X-Men's training squad.",
      "image": "https://i.pinimg.com/736x/8d/56/49/8d5649066ccd7dc0efaafde0d6659370.jpg"
    },
    {
      "id": "32",
      "name": "Hercules",
      "description": "Hercules is a character appearing in American comic books published by Marvel Comics. Debuting in the Silver Age of Comic Books, the character is based on Heracles of Greek mythology. Since his first appearance, he has been a perennial member of the superhero team the Avengers.",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e6/Hercules_%28Marvel_Comics_character%29.jpg/250px-Hercules_%28Marvel_Comics_character%29.jpg"
    },
    {
      "id": "33",
      "name": "Human Cannonball",
      "description": " Cannonball is a mutant who uses the ability to fly at jet speeds while encased in an impenetrable force field. Cannonball was a founding member of the X-Men's junior team, the New Mutants, and served as X-Force's second-in-command and field leader.",
      "image": "https://i.pinimg.com/originals/11/84/40/1184403c2d15a84b950f9eecb6e082ba.png"
    },
    {
      "id": "34",
      "name": "Imperial Guard",
      "description": "The Imperial Guard was a legion of super-powered champions from throughout the intergalactic Shi'ar Empire who acted as enforcers of Imperial law. The original Imperial Guard was formed to stop Rook'shir, a Shi'ar who became the host of the Phoenix Force. ",
      "image": "https://comicvine.gamespot.com/a/uploads/scale_medium/0/77/1005084-prv3685_pg5.jpg"
    },
    {
      "id": "35",
      "name": "Impossible Man",
      "description": "The alien being who became known as the Impossible Man was born on the planet Poppup and is a member of the Poppupian race. Living on a world fraught with danger the Poppupians evolved into a state where they could instantly transform into anything their imagination could create.",
      "image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/86a9a52a-8985-40e0-a86a-56b3b747a9a6/d18ew96-77a91e35-6aef-475e-93e7-28959384cccd.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzg2YTlhNTJhLTg5ODUtNDBlMC1hODZhLTU2YjNiNzQ3YTlhNlwvZDE4ZXc5Ni03N2E5MWUzNS02YWVmLTQ3NWUtOTNlNy0yODk1OTM4NGNjY2QuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.ekUzTtm5WtC4A3Cu3yLbbgl_4G7h8x3omhy0ccvc1KQ"
    },
    {
      "id": "36",
      "name": "Ink",
      "description": "Ink was one of the members of the Young X-Men team that believed themselves to have been organized by Cyclops, with Ink also believing himself to be a mutant. He was a loud-mouthed, rude teenager who didn't care what others thought about him, as proven by when he stood up to two police officers who wished to arrest him in a tattoo parlor. ",
      "image": "https://upload.wikimedia.org/wikipedia/en/7/70/Ink_Wiki.png"
    },
    {
      "id": "37",
      "name": "Jigsaw",
      "description": "Taking advantage of his now hideous visage, the formerly handsome gangster took on the identity of Jigsaw and initially attempted to frame the Punisher for murder. ",
      "image": "https://i.pinimg.com/236x/e4/3f/68/e43f68726b8f2e9eb9ac838786715455.jpg"
    },
    {
      "id": "38",
      "name": "Juggernaut",
      "description": "Cain Marko, better known as Juggernaut, is a long time enemy and sometimes ally of the X-Men. As a child, Cain was regularly abused by his alcoholic father. His stepbrother, Charles Xavier, on the other hand was treated much better while also exceeding him in studies and sports.",
      "image": "https://i.pinimg.com/originals/4d/97/2d/4d972db1cec36ab6b2e5501d750072ed.jpg"
    },
    {
      "id": "40",
      "name": "Joystick",
      "description": "She was once a student at the University of Arizona, living what she considered to be a boring life. After her sophomore year, something changed her. In her new life, she became determined to live life on the edge, and began taking extreme risks. She disappeared for three years, reappearing as Joystick.",
      "image": "https://www.writeups.org/wp-content/uploads/Joystick-Marvel-Comics-Thunderbolts-Janice-Yanizeski-a.jpg"
    },
    {
      "id": "41",
      "name": "Jessica Jones",
      "description": "You shoot that gun at me--I will pull that bullet out of my ruined four hundred dollar leather jacket...and I will shove it up your ass with my pinky finger. And which one of us do you think that will hurt more? ",
      "image": "https://girlswithguns.org/wp-content/uploads/2016/05/jjones2.png"
    },
    {
      "id": "42",
      "name": "Joshua Kane",
      "description": "Joshua Kane enjoyed the thrill of the hunt and was always looking for the next big game. For over twenty years he hunted lions, elephants, gorillas, rhino and even men. He eventually lost the thrill and excitement because it was no longer dangerous for him. In order to get that thrill back, he decided to hunt a werewolf.",
      "image": "https://cmro.travis-starnes.com/images/characters/kanejoshua.jpg"
    },
    {
      "id": "43",
      "name": "King Cobra",
      "description": "Klaus Voorhees whos is also king cobra was an ex-convict working with the humanitarian medical researcher Professor Ezekiel Shecktor in India on a universal antitoxin for snake venom. Jealous of Shecktor's success, Voorhees plotted to kill him and make the murder look like an accident.",
      "image": "http://www.figurerealm.com/userimages/characterprofiles/5000/4596-1-5f40391e18ad6.jpg"
    },
    {
      "id": "44",
      "name": "Loki",
      "description": "Loki Laufeyson, is the Trickster God, God of Mischief, Evil, and Lies, a member of the monstrous Frost Giants of Jotunheim but was adopted and raised among the Asgardians a group of humanoid beings from the pocket dimension of Asgard, the Realm Eternal.",
      "image": "https://iheartcraftythings.com/wp-content/uploads/2021/11/6-21.jpg"
    },
    {
      "id": "45",
      "name": "Logan",
      "description": "Cursed with a berserker fury, the violent mutant known as Wolverine has a reputation of both as an outstanding super hero and as a lethal killer. Born as James Howlett to a wealthy Canadian family at the end of the 19th century, he was forced to abandon his family after the tragic manifestation of his bestial abilities of accelerated healing factor, keenly enhanced senses and bone claws in each hand. ",
      "image": "https://www.writeups.org/wp-content/uploads/Wolverine-Marvel-Comics-Logan-X-Men-Howlett.jpg"
    },
    {
      "id": "48",
      "name": "Thanos",
      "image": "https://w0.peakpx.com/wallpaper/55/926/HD-wallpaper-thanos-crown-infinity-war-marvel-movie.jpg",
      "description": "Thanos is a supervillain appearing in American comic books published by Marvel Comics. Created by writer-artist Jim Starlin, the character first appeared in The Invincible Iron Man."
    }
]}